src/cf/maERP_ib/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Евро</name>
      <description>EUR</description>
    </items>
    <items>
      <name>MoroccanDirham</name>
      <description>MAD</description>
    </items>
    <items>
      <name>РоссийскийРубль</name>
      <description>RUR</description>
    </items>
    <items>
      <name>ДолларСША</name>
      <description>USD</description>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧПараметрыИсчисления</name>
    <attributes>
      <name>Локализация</name>
      <type>
        <types>EnumRef.Локализации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧасть1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧасть2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧасть5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелаяЧастьРод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧастьРод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/maERP_ib/src/Enums/Локализации/Локализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Локализации</name>
  <enumValues>
    <name>ru_RU</name>
  </enumValues>
  <enumValues>
    <name>en_US</name>
  </enumValues>
  <enumValues>
    <name>fr_CA</name>
  </enumValues>
</mdclass:Enum>

src/cf/maERP_ib/src/Catalogs/Валюты/ManagerModule.bsl
Функция СформироватьСуммуПрописью(Сумма, Валюта, Локализация) Экспорт
	Стр = Валюта.ТЧПараметрыИсчисления.Найти(Локализация, "Локализация");
	Если Стр = Неопределено Тогда
		Возврат Строка(Сумма);	
	КонецЕсли;
	ФорматнаяСтрока = "Л = " + Локализация + "; ДП = False";
	Если Локализация = Перечисления.Локализации.ru_RU Тогда
		ПараметрыИсчисления = Стр.ЦелаяЧасть1 + "," + Стр.ЦелаяЧасть2 + "," + Стр.ЦелаяЧасть5 + ", м, " +
						 	Стр.ДробнаяЧасть1 + "," + Стр.ДробнаяЧасть2 + "," + Стр.ДробнаяЧасть5 + ", ж, 2";
	ИначеЕсли Локализация = Перечисления.Локализации.en_US Тогда
		ПараметрыИсчисления = Стр.ЦелаяЧасть1 + "," + Стр.ЦелаяЧасть2 + "," +
						 	Стр.ДробнаяЧасть1 + "," + Стр.ДробнаяЧасть2 + ", 2";
		ФорматнаяСтрока = ФорматнаяСтрока + "; ИИ = Использовать";					
	ИначеЕсли Локализация = Перечисления.Локализации.fr_CA Тогда
		ПараметрыИсчисления = Стр.ЦелаяЧасть1 + "," + Стр.ЦелаяЧасть2 + "," +
						 	Стр.ДробнаяЧасть1 + "," + Стр.ДробнаяЧасть2 + ", 2";
		ФорматнаяСтрока = ФорматнаяСтрока + "; ИИ = Использовать";					
	КонецЕсли;	
	Возврат ЧислоПрописью(Сумма, ФорматнаяСтрока, ПараметрыИсчисления);
КонецФункции

Функция ПолучитьПараметрыИсчисления(Сумма, Валюта, Локализация) Экспорт
	Структура = Новый Структура("ЦелаяЧасть, ДробнаяЧасть", "", "");
	Стр = Валюта.ТЧПараметрыИсчисления.Найти(Локализация, "Локализация");
	Если Стр = Неопределено Тогда
		Возврат Структура;	
	КонецЕсли;
	ЦелаяЧасть = Цел(Сумма);
	ДробнаяЧасть = Сумма - ЦелаяЧасть;
	ЦелаяЧасть = Число(Прав(ЦелаяЧасть, 1));
	ДробнаяЧасть = Число(Прав(ДробнаяЧасть, 1));
	Структура.ЦелаяЧасть = ?(ЦелаяЧасть = 1, Стр.ЦелаяЧасть1, ?(ЦелаяЧасть = 2, Стр.ЦелаяЧасть2, Стр.ЦелаяЧасть5));
	Структура.ДробнаяЧасть = ?(ДробнаяЧасть = 1, Стр.ДробнаяЧасть1, ?(ДробнаяЧасть = 2, Стр.ДробнаяЧасть2, Стр.ДробнаяЧасть5));	
	Возврат Структура;
КонецФункции	

Функция ПолучитьУстановленные() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Валюты.Ссылка КАК Ссылка,
	                      |	Валюты.Код КАК Код,
	                      |	Валюты.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.Валюты КАК Валюты
	                      |ГДЕ
	                      |	Валюты.ПометкаУдаления = ЛОЖЬ");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
